/*
	Герасимчик Анна. 1 курс. 7 группа
	Условие:
	7. Создать абстрактный класс. 
	Создать класс процессор, имеющий мощность (МГц). 
	Определить конструкторы и метод доступа. 
	Создать класс компьютер(наследник абстрактного класса), содержащий класс процессор. 
	Дополнительно есть марка (указатель на строку), цена. 
	Определить конструкторы и деструктор. 
	Определить private-, public- производный класс компьютеров с монитором, имеющий 
	дополнительно размер монитора. 
	Определит конструкторы, деструкторы и функцию печати. 
	Использовать статическую переменную для хранения количества созданных объектов 
	классов наследников и константы для хранения идентификационных номеров в 
	абстрактном классе, в классах наследниках.
*/

#include "Processor.h"

int main()
{

	return 0;
}